articles/2016-Newman2015/Newman2015.org
#+TITLE: Building Microservices (Review)
#+AUTHOR: Ivan Salvadori
#+DESCRIPTION: Review

#+INFOJS_OPT: path:../../HtmlTemplate/ccReport.js
#+HTML_HEAD: <link id="tema" rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />

#+MACRO: tag @@latex:\hfill{}\textsc{$1}@@ @@html:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="$1">$1</span></span>@@

#+TODO: TODO(t) STARTED(s) WAITING(w) | DONE(d) CANCELED(c)

Newman, S. (2015). Building Microservices. (M. Loukides & B. MacDonald, Eds.), O’Reilly. Gravenstein Highway North, Sebastopol, CA. USA: O’Reilly Media.  

* Chapters[12/12]

** DONE Microservices
  CLOSED: [2015-10-07 Qua 18:14]
   It defines DDD by Eric Evans as a model of representing the real world in code, and a better way to model systems. It defines Microservices as *small, autonomous services that work together*.

*** Characteristics
 + *Small, and Focused on Doing One Thing Well*
   + It is about Single Responsibility Principle, which states "Gather together those things that change for the same reason, and separate those things that change for different reasons".

 + *Autonomous*
   + A microservice is a separate entity. All communication between the services are via network calls. These services need to be able to change independly. When deploying a microservice them do not require any consumer change. *The golden rule: can you make a change to a service and deploy it by itself without changing anything else?* 

 + *Technology Heterogeneity* 
   + It is possible to use different techology inside each microservice. It makes easy to rewrite an entire microservices with a new technology. It is possitive the possibility to combine different techonolgies to build a system with different characteristics. 

 + *Resilience* 
   + The main point is the possibilty to isolate a point of failure instead of break down (stop) all the system.

 + *Scaling* 
   + We can scaling microservices in a fine grained way than a entire monolith system. It enables to control cost more effectively.

 + *Easy of Deployment* 
   + It alows to deploy the code faster. if something goes wrong. It is easy to make a rollback. New functionalities can be available faster. 

 + *Organizational Alignment*
   + It is about the alignment of the architecture to the organization. As a result is possible minimize the number of people working on a smaller code base (it is more produtive).   

 + *Composability*
   + Reuse of functionality. Microservices allow functionality to be consumed in different ways for differnt purposes. 

 + *Optimizing for Replaceability*
   + With small services it is easy to replace them with a better implementation. It minimizes the problem of rewrinting a entire service, or kill a service when it is no longer needed.

*** Microservices and SOA
   The author says that SOA has many problems, like communication protocols (SOAP), vendor lock-in, lack of guidance about service granularity and how to split a big system into a something small. It is also said the SOA does not talk enough about real world problems. 

*** My Comments
   It seems that when we talk about independency of microservices, we are talking about the deployment process. Microservices should be independently deployed. However, microservices do not are independent in terms of communication. Probably theses services will change messages to each other. So in that context micorservices are not independent.
 

** DONE The Evolutionary Architect
  CLOSED: [2015-10-08 Qui 09:12]
  This chapter talks about the architect's role and their challenge. Newman stablishes the differences between the engineers/architects (the real ones) and the software architects. The real ones have the discipline, which the software ones do not necessary have. This chapter cites a link for the [[http://12factor.net/][12Factors]] as a set of design principles. 

*** My Comments
   In this chapter there is a big discussion about the architect's role in a microservice architecture. At the end of the chapter, Newman talks about the core responsabilty of the achitect, and cites /autonomy/ as /finding the right balance between standards and enabling autonomy for the teams/. What kind of autonomy the author is talking about? Here, there a lot of levels of autonomy. I guess one of the most challenge problem is related with autonomy, in the context of developing autonomy. Here again there are several levels of developing autonomy. The point is, have the develpers autonomy for modeling their services with autonomy in a scenario where several microservices are composed? 


