articles/2016-Newman2015/Newman2015.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 29/09/2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Microservices (Review)</title>
<meta name="author" content="Ivan Salvadori" />
<meta name="description" content="Review" />
<meta name="generator" content="Org Mode" />

<link id="tema" rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />




</head>
<body>
<div id="content" class="content">
<h1 class="title">Building Microservices (Review)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org21f0e10">1. Chapters<code>[12/12]</code></a>
<ul>
<li><a href="#orgcf77bc3">1.1. <span class="done DONE">DONE</span> Microservices</a>
<ul>
<li><a href="#org3e0ede2">1.1.1. Characteristics</a></li>
<li><a href="#orgd3371f1">1.1.2. Microservices and SOA</a></li>
<li><a href="#org7dfeb53">1.1.3. My Comments</a></li>
</ul>
</li>
<li><a href="#orgad7b374">1.2. <span class="done DONE">DONE</span> The Evolutionary Architect</a>
<ul>
<li><a href="#org908c5c7">1.2.1. My Comments</a></li>
</ul>
</li>
<li><a href="#orge413f42">1.3. <span class="done DONE">DONE</span> How to Model Services</a>
<ul>
<li><a href="#orgd039e02">1.3.1. My Comments</a></li>
</ul>
</li>
<li><a href="#orgcaca757">1.4. <span class="done DONE">DONE</span> Integration</a>
<ul>
<li><a href="#org1a3a2fa">1.4.1. My Comments</a></li>
</ul>
</li>
<li><a href="#org44aa7b0">1.5. <span class="done DONE">DONE</span> Splitting the Monolith</a>
<ul>
<li><a href="#orgc1a8245">1.5.1. My Comments</a></li>
</ul>
</li>
<li><a href="#org6ab9e97">1.6. <span class="done DONE">DONE</span> Deployment</a>
<ul>
<li><a href="#orgfaaf95f">1.6.1. My Comments</a></li>
</ul>
</li>
<li><a href="#org76e3f01">1.7. <span class="done CANCELED">CANCELED</span> Testing</a></li>
<li><a href="#org33f1c08">1.8. <span class="done CANCELED">CANCELED</span> Monitoring</a></li>
<li><a href="#org083d957">1.9. <span class="done CANCELED">CANCELED</span> Security</a></li>
<li><a href="#org57ccad1">1.10. <span class="done DONE">DONE</span> Conway’s Law and System Design</a>
<ul>
<li><a href="#orgc95be61">1.10.1. My Comments</a></li>
</ul>
</li>
<li><a href="#org5fd7d1d">1.11. <span class="done DONE">DONE</span> Microservices at Scale</a>
<ul>
<li><a href="#org3a43402">1.11.1. Comments</a></li>
</ul>
</li>
<li><a href="#org13358f2">1.12. <span class="done DONE">DONE</span> Bringing It All Together</a>
<ul>
<li><a href="#org58093ce">1.12.1. Comments</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org814c930">2. Overall Comments</a></li>
</ul>
</div>
</div>
<p>
Newman, S. (2015). Building Microservices. (M. Loukides &amp; B. MacDonald, Eds.), O’Reilly. Gravenstein Highway North, Sebastopol, CA. USA: O’Reilly Media.  
</p>

<div id="outline-container-org21f0e10" class="outline-2">
<h2 id="org21f0e10"><span class="section-number-2">1.</span> Chapters<code>[12/12]</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcf77bc3" class="outline-3">
<h3 id="orgcf77bc3"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> Microservices</h3>
<div class="outline-text-3" id="text-1-1">
<p>
It defines DDD by Eric Evans as a model of representing the real world in code, and a better way to model systems. It defines Microservices as <b>small, autonomous services that work together</b>.
</p>
</div>

<div id="outline-container-org3e0ede2" class="outline-4">
<h4 id="org3e0ede2"><span class="section-number-4">1.1.1.</span> Characteristics</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><b>Small, and Focused on Doing One Thing Well</b>
<ul class="org-ul">
<li>It is about Single Responsibility Principle, which states "Gather together those things that change for the same reason, and separate those things that change for different reasons".</li>
</ul></li>

<li><b>Autonomous</b>
<ul class="org-ul">
<li>A microservice is a separate entity. All communication between the services are via network calls. These services need to be able to change independly. When deploying a microservice them do not require any consumer change. <b>The golden rule: can you make a change to a service and deploy it by itself without changing anything else?</b></li>
</ul></li>

<li><b>Technology Heterogeneity</b> 
<ul class="org-ul">
<li>It is possible to use different techology inside each microservice. It makes easy to rewrite an entire microservices with a new technology. It is possitive the possibility to combine different techonolgies to build a system with different characteristics.</li>
</ul></li>

<li><b>Resilience</b> 
<ul class="org-ul">
<li>The main point is the possibilty to isolate a point of failure instead of break down (stop) all the system.</li>
</ul></li>

<li><b>Scaling</b> 
<ul class="org-ul">
<li>We can scaling microservices in a fine grained way than a entire monolith system. It enables to control cost more effectively.</li>
</ul></li>

<li><b>Easy of Deployment</b> 
<ul class="org-ul">
<li>It alows to deploy the code faster. if something goes wrong. It is easy to make a rollback. New functionalities can be available faster.</li>
</ul></li>

<li><b>Organizational Alignment</b>
<ul class="org-ul">
<li>It is about the alignment of the architecture to the organization. As a result is possible minimize the number of people working on a smaller code base (it is more produtive).</li>
</ul></li>

<li><b>Composability</b>
<ul class="org-ul">
<li>Reuse of functionality. Microservices allow functionality to be consumed in different ways for differnt purposes.</li>
</ul></li>

<li><b>Optimizing for Replaceability</b>
<ul class="org-ul">
<li>With small services it is easy to replace them with a better implementation. It minimizes the problem of rewrinting a entire service, or kill a service when it is no longer needed.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3371f1" class="outline-4">
<h4 id="orgd3371f1"><span class="section-number-4">1.1.2.</span> Microservices and SOA</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The author says that SOA has many problems, like communication protocols (SOAP), vendor lock-in, lack of guidance about service granularity and how to split a big system into a something small. It is also said the SOA does not talk enough about real world problems. 
</p>
</div>
</div>

<div id="outline-container-org7dfeb53" class="outline-4">
<h4 id="org7dfeb53"><span class="section-number-4">1.1.3.</span> My Comments</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
It seems that when we talk about independency of microservices, we are talking about the deployment process. Microservices should be independently deployed. However, microservices do not are independent in terms of communication. Probably theses services will change messages to each other. So in that context micorservices are not independent.
</p>
</div>
</div>
</div>


<div id="outline-container-orgad7b374" class="outline-3">
<h3 id="orgad7b374"><span class="section-number-3">1.2.</span> <span class="done DONE">DONE</span> The Evolutionary Architect</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This chapter talks about the architect's role and their challenge. Newman stablishes the differences between the engineers/architects (the real ones) and the software architects. The real ones have the discipline, which the software ones do not necessary have. This chapter cites a link for the <a href="http://12factor.net/">12Factors</a> as a set of design principles. 
</p>
</div>

<div id="outline-container-org908c5c7" class="outline-4">
<h4 id="org908c5c7"><span class="section-number-4">1.2.1.</span> My Comments</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
In this chapter there is a big discussion about the architect's role in a microservice architecture. At the end of the chapter, Newman talks about the core responsabilty of the achitect, and cites <i>autonomy</i> as <i>finding the right balance between standards and enabling autonomy for the teams</i>. What kind of autonomy the author is talking about? Here, there a lot of levels of autonomy. I guess one of the most challenge problem is related with autonomy, in the context of developing autonomy. Here again there are several levels of developing autonomy. The point is, have the develpers autonomy for modeling their services with autonomy in a scenario where several microservices are composed? 
</p>
</div>
</div>
</div>
