articles/2016-Newman2015/Newman2015.org
** DONE How to Model Services
  CLOSED: [2015-10-08 Qui 16:49]
In the question What makes a good service it is said to focus on two key concepts: loose coupling and high cohesion. It is explained what those two key concepts mean in terms of microservices. 
 
  + Losse coupling: when a change to one service should not require a change to another.
  + Hight cohesion: finding the boundaries within a problem domain and ensure that related behavior is in one place. It is related to Bounded Context of DDD, wich defines a interface for a given model.
 
  Newman emphasizes the importance of keeping the microservice within a bounded context. Thinking about bounded contexts it is not about the data the is shared, but about the capabilities those context provide to the rest of the domain. It is also provides a explanation about what is a bounded context. For instance, some bounded context could wrap internal bounded contexts. For this situation, it would be possible to split all the internal bounded context to separated services. It is a good idea if each service is managed by different teams. But it is no necessary splitting the coarse-grained bounded context if it is managed as an unity.
  
*** My Comments
   This chapter enphasiszes the idea of reducing the number of places that need to make a change. It is said that the communication between the microservices should follow the same business concepts. So, that restriction motivates the use of ontologies for modeling data and services.  


** DONE Integration
  CLOSED: [2015-10-21 Qua 18:23]
  This chapter aims to show some of the biggest pitfalls of microservice architecture. Is it said some important characteristics that microservices should have, Such as avoid make the consumers out of date due a change of the service, make the services simple for consumers, hide implementation details. Here, Newman remember us about the core principles behind good microservices (Strong cohesion and loose coupling), when he talks about database integration, which none of the principles are present.

  This chapter also discusses about how services collaborate. Should communication be synchronous (request/response) or asynchronous? (event-based). Newman says that the asynchronous communication can be useful for long-running jobs. Event-based collaboration is also highly decoupled. Newman said his preference is choreographed system due to its loose coupling. 

  Newman presents a great explanation about REST and HATEOAS and the benefits of the progressively discovery of the API. He says that the link property /rel/ is responsible to define the protocol used for the application. Hence, the client has to understand the semantics of the API.

  In the asynchronous communication, Newman says to keep the broker dumb and keep the smarts in the endpoints. He also pointed out some of the most common problems when using message brokers.

  Newman talk about how dangerous can be the use of shared library in a microservice architecture. Shared library introduces a high coupling because one change in that library demands changes in all services that use that library.

  The author says that the best way to reduce the impact of make consumers out of date is to avoid making changes. The key point is choose an integration technology that hide implementation details. Newman cites the Postel's law, which means the consumers should be as flexible as possible in consuming a service. In that context, consumers should be able to parse a piece of information sent by the services, even that the structure of the information has been changed a little (added or removed some fields). Newman also explains how to use different approaches for versioning endpoints.

  It is also presented how to build user interfaces to interact with microservices. It is presented the API composition approach, fragment composition among others. In the end of this chapter, Newman talks a bit about third-party software integration (I just did a fast read).

*** My Comments  
   The author's opinion about to void making changes is a key point. The focus of my research is to reduce the needs make such changes. Actually, those changes can happen, but consumers can deal with it. To achieve this, it is necessary to reduce even more the implementation details of REST APIs.  

   Newman says that it is necessary to think about the user interfaces in the context of integration. However, I do not think so, because microservices can be used only to machine-to-machine integrations.

   An alternative to build user interfaces is build them based on resources. It is almost what callimachus does. This approach means that UI is capable of properly render the resources managed by an API.  
 

** DONE Splitting the Monolith
   CLOSED: [2015-12-08 Ter 17:31]
  In this chapter, Newman reminds us that monolithic applications are not highly cohesive neither loosely coupled. It is also explained the concept of seam as a portion of code that can be treated isolated without impacting other code bases.
Newman says that the best approach for splitting the monolith is using an  incremental approach (a piece at a time) instead of splitting all the system in just one step. Here are some guides/reasons that might help:

1. Pace of change: split out the things that are more valuable or that could be done faster and autonomous.
2. Team structure: split out the things in order to a unique team work in a microservice without geographical issues.
3. Security: split out things that require additional security.
4. Technology: represents a possibility to safely try out a new technology.

We have to take into account the level of dependencies between the identified seams.
Moreover, it is said that the mother of all tangled dependencies is *the database*, though, due to this, databases also have to be split out.
However, by splitting out data base in exposing the data over the wire (HTTP calls) probably will affects the performance.

Newman also says here a little about being unable to use transactions over split data bases. He give us three solutions: eventual consistence; compensating transaction and distributed transaction. The Newman's advice is to avoid splitting services that require a transaction to keep the consistence.

Data retrieval via service calls is also discussed.
The way microsevices are organized might make difficult a given consumer obtain data.
A consumer will probably need make requests to several microservices in order to get the desirable data. One solution cited by Newman is to design batch requests, which require a set of data into a conversation process. Using batch requests, the consumer avoid doing a lot of requests over a list of IDs. 
Data pushing is another alternative. A standalone application may retrieve data directly from database and pump into another database. This is an exception on sharing database. An alternative for data pumping is data event, which microservices may emit events when a resource's state change. 

