articles/2016-Newman2015/Newman2015.html

<div id="outline-container-orgc1a8245" class="outline-4">
<h4 id="orgc1a8245"><span class="section-number-4">1.5.1.</span> My Comments</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
By splitting a monolith in several microservices results in a community of fined-grain components that have to communicate with one another in a complex net of dependencies of services spread in a network. 
</p>

<p>
Batch requests seem to be a good way to reduce the number of requests on getting a huge amount of data from Web APIs. This is a real problem barely faced by developers. It is also related to the fact that a given consumer may have different expectation about a service and data. It is not only about databases, it's about expectations and goals.
</p>
</div>
</div>
</div>


<div id="outline-container-org6ab9e97" class="outline-3">
<h3 id="org6ab9e97"><span class="section-number-3">1.6.</span> <span class="done DONE">DONE</span> Deployment</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Newman starts talking about Continuous Integration (CI), which the main goal is to make sure the new code properly integrates with existing code. There are three main activities to performer CI, such as checking all the code committed into a mainline code base, testing the code to make sure it haven't broken the behavior of the system, and when the build is broken, the priority 1 is to fix it.  There are several approaches to adopt when performing CI. However, Newman suggests the adoption of one repository per microservice, with it own source control and build process. The main idea is to avoid the global building for a single change in a single microservice.
</p>

<p>
Newman also talks about Continous Delivery (CD), which relies on the concept of pipelines  for defining the stages of the software build. Here Newman suggests a pipeline per microservice. Newman presents a lof of tools for CD, that facilitates the deplyment and testing in a given process stage, such as slow testes, production teste, and so on.
</p>

<p>
Newman explains some deployment models, such as multiple services per host and single service per host. Considering the autonomy provided by microservices, the deployment have to take into account that different teams are responsible for managing different microservices. That means a single host used to run multiples services owned by different teams breaks their autonomy. Newman suggests to adopt the single host per service model. The author states that by using the one server per host model get the management more complicated. That's is true if the hosts are managed manually. So in that model it is recommended to adopt mechanisms for automating the host management. Newman says that automation is the key to keep complexities under control.
</p>
</div>

<div id="outline-container-orgfaaf95f" class="outline-4">
<h4 id="orgfaaf95f"><span class="section-number-4">1.6.1.</span> My Comments</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
It is not clear at the moment how to evolve a microservice independently of the rest. How to ensure a change in a single microservice will not affect the others? Should we write integration tests in running microservices instances? 
</p>

<p>
Newman take a very flexible position on adopting the different approaches, specially in the early stages of development, when things are not clear enough to make the most accurate decisions. 
</p>

<p>
Now it's clear that through the pipeline the software might be deployed and tested. 
</p>
</div>
</div>
</div>


<div id="outline-container-org76e3f01" class="outline-3">
<h3 id="org76e3f01"><span class="section-number-3">1.7.</span> <span class="done CANCELED">CANCELED</span> Testing</h3>
<div class="outline-text-3" id="text-1-7">
<p>
This chapter was intentionally postponed due to low priority in this subject.
</p>
</div>
</div>

<div id="outline-container-org33f1c08" class="outline-3">
<h3 id="org33f1c08"><span class="section-number-3">1.8.</span> <span class="done CANCELED">CANCELED</span> Monitoring</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This chapter was intentionally postponed due to low priority in this subject.
</p>
</div>
</div>

<div id="outline-container-org083d957" class="outline-3">
<h3 id="org083d957"><span class="section-number-3">1.9.</span> <span class="done CANCELED">CANCELED</span> Security</h3>
<div class="outline-text-3" id="text-1-9">
<p>
This chapter was intentionally postponed due to low priority in this subject.
</p>
</div>
</div>


<div id="outline-container-org57ccad1" class="outline-3">
<h3 id="org57ccad1"><span class="section-number-3">1.10.</span> <span class="done DONE">DONE</span> Conway’s Law and System Design</h3>
<div class="outline-text-3" id="text-1-10">
<p>
It is all about the Melvin Conway’s paper How Do Committees Invent, published in Datamation magazine in April 1968 taht says:
</p>

<p>
"<i>Any organization that designs a system (defined more broadly here than just information systems) will inevitably produce a design whose structure is a copy of the organization’s communication structure</i>"
</p>

<p>
This chapter basically brings nothing new. It discusses some forms of organizing teams.
</p>
</div>

<div id="outline-container-orgc95be61" class="outline-4">
<h4 id="orgc95be61"><span class="section-number-4">1.10.1.</span> My Comments</h4>
<div class="outline-text-4" id="text-1-10-1">
<p>
Actually, the majority of these aspects regarding development teams also could be applied to other context other than microservices. It seems that, in this matter, microservices just bring people organization best practices. But I agree with Conway's Low, because people need concrete things to support their daily-life ditties, and communication structure is something concrete and very real. 
</p>
</div>
</div>
</div>
