articles/2016-Newman2015/Newman2015.html


<div id="outline-container-org5fd7d1d" class="outline-3">
<h3 id="org5fd7d1d"><span class="section-number-3">1.11.</span> <span class="done DONE">DONE</span> Microservices at Scale</h3>
<div class="outline-text-3" id="text-1-11">
<p>
This chapter addresses issues related to situations where microservices reache a more complex scenarios with hundreds of services.
</p>

<p>
Concepts such as circuit breakers, bulkheads and isolation are presented as solutions to deal with failures. Furthermore, failures should be treat as something natural in systems, and system should embrace them, not try to avoid them - what is impossible.
</p>

<p>
Idempotency is described as a alternative to solve some failures, since this type of operation allows the client repenting several times the request without any undesirable effect. Moreover, the author makes clear the importance to respect the HTTP verb semantics to do not create misunderstanding problems concerning idempotency.
</p>

<p>
The use of load balancers allows to add more microservices at runtime, so it improves the resiliency and also the computing load.  
</p>

<p>
It is important to separate the concept of service availability from data durability. In this sense, it is possible to separate read operation from write operations when one of them is more required. One way to do that is using database read replica. However, in this scenario, the a given write operation will update just a master database, and then it will replicate to the replicas at some moment after the write. However, the author recommends to consider first the use of caching, which demands less effort. With regard caching, this chapter presents three different approaches, such as client-side, proxy and service-side. For writing operations, sharding may be used to scale. By using sharding, we have multiple database nodes, in which the data is stored based on a distribution function. Finally, a traditional RDBMS is able to handle multiple schemes, each one for a single microservice. However, it is considered a single point of failure, and should only be used considering the involved risks.
</p>

<p>
This chapter also presents the Command-Query Responsibility Segregation (CQRS) pattern, which separate commands, which modify state, from queries, which retrieve information. This separation invloves using independente internal models for reading and for data modification.
</p>

<p>
The CAP theorem means that in a distributed system, it is just possible to choose two features among <i>consistency</i>, <i>availability</i> and <i>partition tolerance</i>. "<i>Consistency is the system characteristic by which I will get the same answer if I go to multiple nodes. Availability means that every request receives a response. Partition tolerance is the system’s ability to handle the fact that communication between its parts is sometimes impossible.</i>"
</p>

<p>
This chapter also brings service discovery to discussion. It is said that it provides mechanisms for a microservice to register and also to find the service once it is registered. It starts describing DNS and then presents dynamic service registries, such as Zookeeper, Consul and Eureka. Zookeeper is used for synchronizing data between services, leader election, message queues, and (usefully for us) as a naming service. However, it allows to store the information about where our services are located in this structure. Consul supports both configuration management and service discovery. It can retrive both an IP and port for a given name. Eureka is a configuration store and also a load-balancer.
</p>

<p>
At the end, this chapter presents Swagger and HAL as solution for describing services.
"<i>Swagger lets you describe your API in order to generate a very nice web UI that allows you to view the documentation and interact with the API via a web browser.</i>". "<i>HAL is a standard that describes standards for hypermedia controls that we expose.</i>". "<i>The fact that HAL also describes a hypermedia standard with some supporting client libraries is an added bonus, and I suspect is a big reason why I’ve seen more uptake of HAL as a way of documenting APIs than Swagger for those people already using hypermedia controls.</i>"
</p>
</div>



<div id="outline-container-org3a43402" class="outline-4">
<h4 id="org3a43402"><span class="section-number-4">1.11.1.</span> Comments</h4>
<div class="outline-text-4" id="text-1-11-1">
<p>
Newman starts talking about failure, such as network and physical components failure. It is said that a single point should be avoid. However, it is recommend a load balancer, which represents a single entrance point to the system. However, I'm my point of view, this is a general topic that could be applied to any software development, not specifically to microservices. In addition, too much story to describe the content, including anecdotes from big companies to personal experiences.
</p>

<p>
There is a lot of information about caching. However, all this is not specific to microservices, which put a huge amount of concepts together. As a result, it is difficult to properly define microservices with those related topics.
</p>

<p>
It is quite strange that service discovery is presented after service description. How to discover service without describe them? Newman starts describing service discovery by presenting DNS, which I consider just a name resolver, not a service discovery method properly. Moreover, it presents Zookeeper in which was originally developed for a different purpose than service discovery. However, the author says that Zookeeper itself is fairly generic in what it offers. Consult shares the same issues, it only returns IP and port based on a given name. How about the microservice capability? Finally, Eureka is a configuration store and also performs loading-balancing. It seems that service discovery tools are not specialized in service discovery.
</p>
</div>
</div>
</div>




<div id="outline-container-org13358f2" class="outline-3">
<h3 id="org13358f2"><span class="section-number-3">1.12.</span> <span class="done DONE">DONE</span> Bringing It All Together</h3>
<div class="outline-text-3" id="text-1-12">
<p>
This chapter summarizes microservice principles:
</p>

<ol class="org-ol">
<li><b>Model around business concepts</b>: interfaces structured around business are more stable than those structured around technical concepts.</li>

<li><b>Adopt a Culture of Automation Microservices</b>: aims at addressing microservice complexity.</li>

<li><b>Hide Internal Implementation Details</b>: to maximize the ability of one service to evolve independently of any others. Services should also hide their databases.</li>

<li><b>Decentralize All the Things</b>: to maximize the autonomy of microservices by delegating decision making and control to the teams that own the services themselves. It Avoids approaches like enterprise service bus or orchestration systems, which can lead to centralization of business logic and dumb services.</li>

<li><b>Independently Deployable</b>: to ensure that our microservices can and are deployed by themselves.</li>

<li><b>Isolate Failure</b>: to understand and plan for failures in part of our system.</li>

<li><b>Highly Observable</b>: it is not possible to observe the behavior of a single service instance or the status of a single machine to see if the system is functioning correctly.</li>
</ol>
</div>



<div id="outline-container-org58093ce" class="outline-4">
<h4 id="org58093ce"><span class="section-number-4">1.12.1.</span> Comments</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
It seems that most of microservice principles could be easily applied to any type of software. 
</p>
</div>
</div>
</div>
</div>
