articles/2016-Newman2015/Newman2015.org
* Overall Comments
Microservices principles rely on several software engineering subjects. I think that would be interesting to isolate all those subjects regarding software engineering and to analyze microservices focused on distributed systems aspects only.

There are a variety of topics related to microservices, such as deployment techniques, team/people management, security, monitoring, failure recovery, among others. These topics could be easily be applied to general software development. however, these off-topics are put together with microservices, which makes difficult to understand what characteristics are specific to microservices.

For sure this book has a lot of positive characteristics. However, Newman wrote too many words to say what he meant to say. In order to explain a given concept, he introduces a whole story. That's no completely bad, but in this case he could go directly to the point. That made this book boring and time demanding.


