articles/2016-Newman2015/Newman2015.html


<div id="outline-container-org814c930" class="outline-2">
<h2 id="org814c930"><span class="section-number-2">2.</span> Overall Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
Microservices principles rely on several software engineering subjects. I think that would be interesting to isolate all those subjects regarding software engineering and to analyze microservices focused on distributed systems aspects only.
</p>

<p>
There are a variety of topics related to microservices, such as deployment techniques, team/people management, security, monitoring, failure recovery, among others. These topics could be easily be applied to general software development. however, these off-topics are put together with microservices, which makes difficult to understand what characteristics are specific to microservices.
</p>

<p>
For sure this book has a lot of positive characteristics. However, Newman wrote too many words to say what he meant to say. In order to explain a given concept, he introduces a whole story. That's no completely bad, but in this case he could go directly to the point. That made this book boring and time demanding.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ivan Salvadori</p>
<p class="date">Created: 29/09/2023</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>